Revit 2024 API
BuiltInFailures.StructuralCustomConnectionFailures.StructuralCustomConnectionEmpty Property
 Structural Custom Connection cannot be empty.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId StructuralCustomConnectionEmpty { get; }
Visual Basic
Public Shared ReadOnly Property StructuralCustomConnectionEmpty As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ StructuralCustomConnectionEmpty {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StructuralCustomConnectionFailures Class
Autodesk.Revit.DB Namespace